# PANDAS - DAY 3 ( TIPS AND TRICKS )

### 01 . How to find the version?

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

In [4]:
pd.show_versions()

c:\Users\Administrator\AppData\Local\Programs\Python\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 65.5.0
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.13.2
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.2
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### 02- Making a Data Frame

In [5]:
df=pd.DataFrame({'Name ':["Uzair","Abbas","Lahad","Razi","Bilal"],'Age ': [20,19,21,22,19]})

In [6]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [7]:
df.head()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [8]:
df.tail()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [9]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [10]:
# numpy array to create dataframe
import numpy as np
arr=np.array([['Uzair',20],['Abbas',19],['Lahad',21],['Razi',22],['Bilal',19]])
# arr
df=pd.DataFrame(arr,columns=['Name','Age'])
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [11]:
# numpy array data frame
pd.DataFrame(np.random.rand(5,2))
pd.DataFrame(np.random.rand(5,2), columns=list("AB"))

          A         B
0  0.916008  0.320232
1  0.035329  0.778435
2  0.356869  0.721092
3  0.135765  0.269844
4  0.902925  0.868160

In [12]:
pd.DataFrame(np.random.rand(50,20))

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.427717,0.912848,0.998962,0.363053,0.712400,0.090604,0.023230,0.151846,0.696854,0.952378,0.340734,0.858170,0.738310,0.885699,0.130928,0.485122,0.316276,0.106654,0.060907,0.712161
1,0.897591,0.592915,0.449599,0.785217,0.501353,0.753327,0.693038,0.085854,0.263161,0.008511,0.831414,0.159301,0.530419,0.129738,0.080473,0.668210,0.671348,0.608983,0.707699,0.777683
2,0.963082,0.460366,0.803217,0.465935,0.653602,0.635549,0.388229,0.388118,0.809457,0.771730,0.909868,0.824659,0.306291,0.092892,0.379272,0.356702,0.212965,0.053325,0.902043,0.742686
3,0.204108,0.496668,0.344193,0.910383,0.175165,0.371353,0.182155,0.743963,0.547922,0.492278,0.306309,0.471058,0.319663,0.146486,0.361247,0.319377,0.084480,0.234686,0.874219,0.806142
4,0.009747,0.727597,0.467625,0.475209,0.915204,0.912527,0.925650,0.304551,0.182153,0.220337,0.913272,0.782891,0.546198,0.279478,0.693563,0.807807,0.884219,0.301580,0.512383,0.429611
5,0.519797,0.938612,0.705867,0.440577,0.555804,0.908178,0.140038,0.073196,0.971902,0.082440,0.148843,0.278336,0.067430,0.959266,0.799756,0.892143,0.347520,0.317278,0.837228,0.014960
6,0.706187,0.405186,0.058399,0.349288,0.534446,0.163132,0.891868,0.064106,0.497812,0.907976,0.993961,0.268157,0.105781,0.987348,0.871678,0.843125,0.332948,0.233336,0.577744,0.955316
7,0.406392,0.780913,0.908027,0.905164,0.266052,0.866142,0.981457,0.345957,0.016039,0.865992,0.257481,0.988109,0.866177,0.496798,0.496343,0.574363,0.616880,0.801679,0.768041,0.151963
8,0.579488,0.789927,0.096872,0.424822,0.915023,0.623100,0.445133,0.492983,0.242392,0.115120,0.211650,0.994227,0.987047,0.980889,0.774241,0.819469,0.889574,0.152185,0.857966,0.771703
9,0.519926,0.042213,0.341031,0.929856,0.890145,0.988717,0.186898,0.795582,0.625589,0.114561,0.961996,0.379517,0.620267,0.220504,0.143533,0.190540,0.691558,0.087253,0.961820,0.931014
10,0.041382,0.183825,0.586585,0.194628,0.711582,0.144317,0.209133,0.054324,0.578438,0.408787,0.729072,0.990855,0.993637,0.887513,0.144528,0.319587,0.690793,0.669038,0.022901,0.257985
11,0.084966,0.433095,0.178145,0.666043,0.127276,0.367736,0.108975,0.104300,0.381678,0.461462,0.101646,0.644659,0.526139,0.340892,0.503476,0.659599,0.919205,0.685534,0.860963,0.421707
12,0.012261,0.740780,0.231503,0.372439,0.671354,0.001070,0.966875,0.120886,0.976548,0.444031,0.003621,0.045723,0.818135,0.409437,0.411910,0.046204,0.003567,0.337900,0.907288,0.555999
13,0.094347,0.348939,0.914881,0.289863,0.537508,0.267313,0.461131,0.631502,0.139708,0.084101,0.988224,0.162906,0.523517,0.858917,0.323112,0.026803,0.773571,0.829432,0.396587,0.781472
14,0.806634,0.804482,0.511083,0.769911,0.520744,0.357381,0.035292,0.558054,0.490656,0.471282,0.303936,0.986439,0.775416,0.579788,0.284451,0.209941,0.097702,0.939334,0.942445,0.854595
15,0.670492,0.336054,0.635933,0.412974,0.496470,0.523024,0.296598,0.197623,0.713430,0.018210,0.692905,0.432519,0.640746,0.455937,0.011495,0.604669,0.786531,0.198946,0.397916,0.877057
16,0.151286,0.454439,0.526751,0.403457,0.892453,0.009934,0.081496,0.423038,0.002065,0.288095,0.333189,0.571536,0.769258,0.160232,0.753655,0.371804,0.964968,0.433312,0.977807,0.630652
17,0.911679,0.502829,0.598301,0.048900,0.443026,0.149972,0.940186,0.114532,0.829974,0.406094,0.717887,0.367319,0.452055,0.600365,0.705467,0.274227,0.614723,0.317589,0.014856,0.719228
18,0.436248,0.677910,0.814938,0.586690,0.941279,0.733109,0.493497,0.565410,0.291786,0.292888,0.877063,0.898538,0.998116,0.682745,0.235948,0.144670,0.927521,0.855446,0.989619,0.641119
19,0.017389,0.249157,0.412181,0.361804,0.544728,0.054807,0.623507,0.229010,0.548577,0.811157,0.668664,0.500997,0.866095,0.181415,0.903686,0.046929,0.528830,0.596640,0.285987,0.166331
20,0.340973,0.588917,0.919596,0.848354,0.170890,0.274630,0.543868,0.722043,0.986485,0.382396,0.794909,0.616598,0.765563,0.835368,0.971424,0.331157,0.311109,0.068015,0.552727,0.667325
21,0.140501,0.892959,0.131532,0.817918,0.581896,0.039920,0.293173,0.534190,0.498718,0.835711,0.926184,0.681761,0.070166,0.146086,0.145066,0.760127,0.119018,0.789100,0.391444,0.799871
22,0.869548,0.413181,0.384998,0.355971,0.496451,0.108261,0.316265,0.223454,0.801811,0.300112,0.899256,0.702048,0.320156,0.652091,0.589494,0.647865,0.689461,0.147836,0.480787,0.250310
23,0.068409,0.235140,0.491454,0.212419,0.261482,0.032286,0.120052,0.472057,0.737422,0.208602,0.166843,0.085373,0.479725,0.537482,0.283085,0.096306,0.427270,0.905445,0.889878,0.678582
24,0.929951,0.992039,0.460679,0.037178,0.375603,0.306751,0.291966,0.414633,0.813806,0.784642,0.858693,0.016683,0.486846,0.949896,0.401175,0.042337,0.039273,0.880696,0.063659,0.777270
25,0.261672,0.720898,0.885418,0.388503,0.233726,0.772170,0.446383,0.058094,0.072308,0.521068,0.830284,0.860922,0.508143,0.436720,0.198107,0.725748,0.631023,0.202478,0.735804,0.178850
26,0.813128,0.969917,0.720264,0.437018,0.806208,0.189848,0.839264,0.079034,0.191134,0.951788,0.409794,0.847958,0.839316,0.947041,0.851411,0.564744,0.487041,0.389887,0.295753,0.541916
27,0.654270,0.581330,0.432397,0.358582,0.700881,0.390058,0.772622,0.731456,0.842156,0.981882,0.276527,0.081643,0.030457,0.783146,0.837792,0.838307,0.651173,0.171289,0.055347,0.950444
28,0.125876,0.910266,0.568888,0.201556,0.768544,0.613482,0.598416,0.558391,0.806310,0.473353,0.530281,0.776573,0.494631,0.940144,0.160248,0.664517,0.137247,0.303852,0.325769,0.368080
29,0.742624,0.973328,0.024653,0.404511,0.400359,0.771219,0.610656,0.066501,0.894583,0.574251,0.059236,0.106473,0.825624,0.326103,0.175076,0.299569,0.860133,0.556678,0.724169,0.305712
30,0.364061,0.582824,0.351687,0.737808,0.186340,0.749602,0.381275,0.330749,0.217029,0.034978,0.740632,0.831865,0.387630,0.514028,0.262061,0.703874,0.088167,0.037256,0.185236,0.272735
31,0.128075,0.165498,0.780259,0.550477,0.866935,0.573622,0.238620,0.248633,0.408108,0.710712,0.513789,0.235373,0.394816,0.065096,0.269577,0.557910,0.043688,0.088233,0.769835,0.978201
32,0.533911,0.782366,0.098385,0.642106,0.170710,0.536371,0.350835,0.466650,0.349660,0.886030,0.659133,0.319161,0.963518,0.357479,0.624291,0.925948,0.778019,0.195426,0.099438,0.378493
33,0.553518,0.240306,0.588775,0.539265,0.837045,0.781181,0.188504,0.709891,0.386825,0.960871,0.047612,0.765781,0.950750,0.136922,0.717420,0.976598,0.414458,0.354926,0.980046,0.148085
34,0.182868,0.362822,0.647090,0.979653,0.752488,0.100450,0.895718,0.915666,0.241965,0.845114,0.190308,0.718596,0.754546,0.676568,0.439745,0.897903,0.384704,0.543907,0.680295,0.466230
35,0.557777,0.439541,0.233498,0.031126,0.820772,0.305419,0.447634,0.927381,0.132094,0.981066,0.293514,0.802467,0.535123,0.293984,0.718024,0.529621,0.915897,0.314937,0.528404,0.033974
36,0.066620,0.282727,0.927304,0.949522,0.947380,0.481580,0.682549,0.062870,0.705197,0.210765,0.075598,0.771460,0.687325,0.455990,0.202693,0.206193,0.498743,0.580739,0.040494,0.402317
37,0.809670,0.867763,0.234962,0.482591,0.307594,0.619507,0.121205,0.703143,0.452754,0.184488,0.014553,0.401447,0.830305,0.878553,0.650216,0.314173,0.991712,0.304283,0.378592,0.595302
38,0.185795,0.969228,0.000494,0.777978,0.057538,0.534760,0.415642,0.412285,0.245780,0.087267,0.188885,0.451214,0.276153,0.825803,0.106280,0.113873,0.833868,0.379694,0.162458,0.869136
39,0.372052,0.143856,0.342398,0.200962,0.425636,0.871763,0.407962,0.963440,0.410162,0.540720,0.725049,0.422698,0.690736,0.358437,0.901616,0.557072,0.774119,0.853018,0.080292,0.926101
40,0.302309,0.201518,0.987177,0.879396,0.427950,0.810876,0.659325,0.810250,0.094724,0.469457,0.935874,0.241162,0.227417,0.467690,0.881833,0.470553,0.365854,0.486205,0.219114,0.183515
41,0.166098,0.978071,0.631252,0.530422,0.553664,0.953594,0.632870,0.393827,0.453269,0.909968,0.292165,0.299257,0.309414,0.397186,0.431798,0.001361,0.408429,0.316708,0.806707,0.042764
42,0.410143,0.206991,0.908391,0.048910,0.100476,0.830310,0.115038,0.635505,0.192481,0.961687,0.218703,0.560933,0.855762,0.752480,0.042238,0.101385,0.403738,0.988095,0.401880,0.064474
43,0.916678,0.356799,0.347898,0.256776,0.777865,0.490534,0.219743,0.138226,0.275186,0.599496,0.088878,0.418189,0.090455,0.382050,0.383749,0.265993,0.614569,0.401335,0.994745,0.093348
44,0.981043,0.791665,0.650261,0.645627,0.068412,0.078907,0.669866,0.721581,0.487492,0.176090,0.935459,0.123055,0.538195,0.060106,0.145212,0.302581,0.772433,0.694480,0.297221,0.864654
45,0.080234,0.047056,0.779722,0.511916,0.805423,0.161777,0.419895,0.082228,0.295002,0.956593,0.051988,0.755163,0.436100,0.158677,0.737611,0.138692,0.668856,0.166549,0.032475,0.708998
46,0.452548,0.602021,0.852730,0.214090,0.409088,0.267272,0.281663,0.702691,0.481711,0.940843,0.890706,0.300636,0.169516,0.314566,0.017582,0.287384,0.622810,0.242878,0.416056,0.425754
47,0.771677,0.165321,0.664892,0.727563,0.063487,0.069009,0.066780,0.900175,0.120167,0.908735,0.932609,0.425110,0.250427,0.365503,0.841302,0.945043,0.119051,0.646392,0.977052,0.535864
48,0.620911,0.715700,0.174542,0.052669,0.692101,0.788856,0.263534,0.208069,0.065101,0.491457,0.496123,0.990197,0.012202,0.285538,0.241553,0.966289,0.834191,0.929657,0.619906,0.966933
49,0.288377,0.092161,0.434326,0.503016,0.524519,0.835948,0.289262,0.845345,0.016963,0.785847,0.154297,0.580277,0.422066,0.467423,0.301665,0.188501,0.730404,0.136894,0.243386,0.648168

In [13]:
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [14]:
# how to rename column names
df=pd.DataFrame({'A col ':[1,2,3,4,5],'B col ': [20,19,18,17,16]})

In [15]:
df.rename(columns={'A col': 'a col','B col':'b col'}, inplace=True)

In [16]:
df

   A col   B col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [17]:
df.columns=['aa_col','bb_col']

In [18]:
df

   aa_col  bb_col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [19]:
# to replace any character, string, lateral
df.columns=df.columns.str.replace('_',' ')

In [20]:
df

   aa col  bb col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [21]:
# adding prefix
df.add_prefix('UHS_')

   UHS_aa col  UHS_bb col
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

In [22]:
# adding suffix
df.add_suffix('_UHS')

   aa col_UHS  bb col_UHS
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

# 4 using template data

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
#  summary
kashti.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
# cloumns names
kashti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [26]:
# saving a template dataset

kashti.to_csv('kashti.csv')

In [27]:
# saving to excel
kashti.to_excel('kashti.xlsx')

In [28]:
# viewing csv file
kashti=pd.read_csv('kashti.csv')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
# reading excel file
kashti=pd.read_excel('kashti.xlsx')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
# to text file
kashti.to_csv('kashti.txt',sep='\t')

In [31]:
#  reading text file
kashti=pd.read_csv('kashti.txt',sep='\t')
kashti

,Unnamed: 0.1,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 5 using your own data

In [32]:
import pandas as pd
df = pd.read_csv('database.csv')
df

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.2460,145.6160,Earthquake,131.60,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.8630,127.3520,Earthquake,80.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.5790,-173.9720,Earthquake,20.00,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.0760,-23.5570,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.9380,126.4270,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23407,12/28/2016,08:22:12,38.3917,-118.8941,Earthquake,12.30,1.2,40.0,5.6,ML,...,18.0,42.47,0.120,NaN,0.1898,NN00570710,NN,NN,NN,Reviewed
23408,12/28/2016,09:13:47,38.3777,-118.8957,Earthquake,8.80,2.0,33.0,5.5,ML,...,18.0,48.58,0.129,NaN,0.2187,NN00570744,NN,NN,NN,Reviewed
23409,12/28/2016,12:38:51,36.9179,140.4262,Earthquake,10.00,1.8,NaN,5.9,MWW,...,NaN,91.00,0.992,4.8,1.5200,US10007NAF,US,US,US,Reviewed
23410,12/29/2016,22:30:19,-9.0283,118.6639,Earthquake,79.00,1.8,NaN,6.3,MWW,...,NaN,26.00,3.553,6.0,1.4300,US10007NL0,US,US,US,Reviewed
23411,12/30/2016,20:08:28,37.3973,141.4103,Earthquake,11.94,2.2,NaN,5.5,MB,...,428.0,97.00,0.681,4.5,0.9100,US10007NTD,US,US,US,Reviewed

In [33]:
df.head()

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.246,145.616,Earthquake,131.6,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.863,127.352,Earthquake,80.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.579,-173.972,Earthquake,20.0,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.076,-23.557,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.938,126.427,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic

# 6 reverse row order

In [34]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [35]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [36]:
# to check in descending order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [37]:
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 7- reverse colun order

In [38]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# 8- select a cloumn by a data type

In [39]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [40]:
# only select those having numeric datatype

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [41]:
#  those with float
df.select_dtypes(include=['float']).head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [42]:
#  those with object
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [43]:
#  those with multiple datatypes
df.select_dtypes(include=['float','number','object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [44]:
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

# 9- convert numbers into strings

In [45]:
# creating a dataframe
df = pd.DataFrame({'col a' : ['1','2','3','4','5'],
                   'col b':['6','7','8','9','10']})
df

  col a col b
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [46]:
df.dtypes

col a    object
col b    object
dtype: object

In [47]:
# changing datatype to numeric
pd.to_numeric(df['col a'],errors='coerce')
df.dtypes

col a    object
col b    object
dtype: object

In [48]:
#  changing type object to int
df=df.astype({'col a':'int','col b':'object'})

In [49]:
df.dtypes

col a     int32
col b    object
dtype: object

In [50]:
# changing datatype to numeric
df=pd.to_numeric(df['col b'],errors='coerce')